import streamlit as st
import datetime


class CombatMedic:

    def main(self):
        
        st.title('💊Medic Combat🥼')
        st.subheader("your soul is mine")
        st.success("สวัสดี 🌡นี่คือเว็บที่ใช้สำหรับแนะนำยาตามอาการป่วยของคุณ โปรดเช็คสุขภาพด้านล่าง💉 ")
        
        
        weigh = st.number_input("กรอกน้ำหนักของคุณ(kg)")
        high = st.number_input("กรอกส่วนสูงของคุณ(cm)")
        birthdate = st.date_input("กรอกอายุของคุณ", min_value=datetime.date(1800, 1, 1), max_value=datetime.date.today())
        
        if st.button("คำนวณ BMI"):
            bmi = weigh / ((high / 100) ** 2)
            st.write(f"ตอนนี้คุณอายุ {birthdate} ปี")
            if bmi < 18.50:
                st.error(f"ค่า BMI ของคุณคือ: {bmi:.2f} ต่ำกว่าเกณฑ์")
            elif bmi < 22.90:
                st.success(f"ค่า BMI ของคุณคือ: {bmi:.2f} สุขภาพดี")
            elif bmi <24.90:
                st.success(f"ค่า BMI ของคุณคือ: {bmi:.2f} ท้วม")
            elif bmi <29.90:
                st.error(f"ค่า BMI ของคุณคือ: {bmi:.2f} อ้วน")
            elif bmi >30:
                st.warning(f"ค่า BMI ของคุณคือ: {bmi:.2f} อ้วนมาก")         
                
            
        choice1 = st.selectbox("ลักษณะอาการ:", ("ไข้", "น้ำมูกไหลและจาม", "ไอ", "เจ็บคอ", "ปวดร่างกาย", "อาการท้องเสีย", "อาการคัดจมูก", "อาการท้องผูกหรือท้องเสีย"))
        button_clicked, button_recoment = st.columns([1.5, 2])        
        
        with button_clicked:
            
            if st.button("น้อมรับคำทำนาย"):
                if choice1 == "ไข้":
                    st.subheader("ควรรับพาราเซตามอลหรืออะสไปริน")
                    st.write("- พาราเซตามอล(Paracetamol): สามารถลดไข้และบรรเทาอาการปวดได้")
                    st.write("- อะสไปริน(Aspirin): ใช้ลดไข้และบรรเทาอาการปวดได้")
                    st.write("- การสูงขึ้นของอุณหภูมิร่างกายเป็นอาการที่พบเห็นได้บ่อยเมื่อเจ็บป่วย สามารถเกิดจากการติดเชื้อแบคทีเรีย ไวรัส หรือการต่อสู้ของร่างกายกับสิ่งต่างๆ ที่เข้ามาภูมิคุ้มกัน")
                elif choice1 == "น้ำมูกไหลและจาม":
                    st.subheader("ควรรับคลอเฟนิรามีนหรือไลอะโทนิล")
                    st.write("- คลอเฟนิรามีน (Chlorpheniramine): ใช้บรรเทาอาการแพ้และอาการจาม")
                    st.write("- น้ำมูกไหลและจาม: การติดเชื้อหรือแพ้ฝุ่นละออง โรคหวัด หรือโรคภูมิแพ้อื่นๆ สามารถทำให้เกิดอาการน้ำมูกไหลและจามได้")
                elif choice1 == "ไอ":
                    st.subheader("ควรรับยาลดอาการไอ เช่น สิรพจน์ หรือโดเกิร์น")
                    st.write("- ไอ: ไอเป็นอาการที่เกิดขึ้นเนื่องจากการติดเชื้อทางเดินหายใจหรือการระคายเคืองในลำคอ อาจเป็นอาการร่วมกับโรคหวัด ไข้หวัด หรือการติดเชื้อทางเดินหายใจบน")
                elif choice1 == "เจ็บคอ":
                    st.subheader("ควรรับยาแก้ปวดคอ เช่น พาราเซตามอล หรือยาลดการอักเสบ เช่น ลิดอเคน")
                    st.write("- เจ็บคอ: เจ็บคอเป็นอาการที่พบได้ในการติดเชื้อทางเดินหายใจ หรืออาจเกิดจากการระคายเคืองจากเชื้อแบคทีเรียหรือไวรัส")
                elif choice1 == "ปวดร่างกาย":
                    st.subheader("ควรรับยาแก้ปวด เช่น พาราเซตามอล หรือยาลดอาการปวดอื่น ๆ")
                    st.write("- ปวดร่างกาย: อาการปวดร่างกายสามารถเกิดขึ้นจากหลายสาเหตุ เช่น ไข้ หวัด หรือโรคอื่นๆ โดยทั่วไปอาการนี้จะดูเหมือนอาการปวดต่างๆ บนร่างกายทั่วไป")
                elif choice1 == "อาการท้องเสีย":
                    st.subheader("ควรรับยาแก้ท้องเสีย เช่น ไซโตโปแมทิด หรือยาลดการปวดท้อง เช่น ลูเปอร์มายด์")
                    st.write("- อาการท้องเสีย: การท้องเสียเป็นอาการที่พบได้บ่อยเมื่อมีการติดเชื้อทางเดินอาหาร หรือการบริโภคอาหารหรือน้ำที่ไม่สะอาด")
                elif choice1 == "อาการคัดจมูก":
                    st.subheader("ควรรับยาลดอาการคัดจมูก เช่น คลอเฟนิรามีน หรือยาลดอาการจมูกอื่น ๆ")
                    st.write("- อาการคัดจมูก: การคัดจมูกเป็นอาการที่เกิดขึ้นเมื่อมีการติดเชื้อหรือแพ้ฝุ่นละออง สามารถเป็นอาการร่วมกับการเจ็บป่วยอื่นๆ ได้")
                elif choice1 == "อาการท้องผูกหรือท้องเสีย":
                    st.subheader("ควรรับยาแก้ท้องผูกหรือท้องเสีย เช่น ลูฟอลาคลลีด หรือยาลดการอักเสบในทางเดินอาหาร เช่น รานิเทดีน")
                    st.write("- อาการท้องผูกหรือท้องเสีย: อาการเจ็บป่วยอาจเป็นสาเหตุให้เกิดอาการท้องผูกหรือท้องเสีย เช่น เมื่อมีการบริโภคอาหารที่ไม่สะอาดหรือเสี่ยงต่อการติดเชื้อในทางเดินอาหาร")

        with button_recoment:
            if st.button("คำแนะนำการใช้ยา"):
                st.subheader("คำแนะนำก่อนใช้ยา")
                st.info("1. การใช้ยาควรปฏิบัติตามคำแนะนำของแพทย์หรือเภสัชกรอย่างเคร่งครัดเสมอ นอกจากนี้ ยังควรทำตามขั้นตอนต่อไปนี้เพื่อให้การใช้ยาเป็นไปอย่างปลอดภัยและมีประสิทธิภาพ")
                st.info("2. อ่านฉลากบรรจุภัณฑ์: อ่านคำแนะนำการใช้งานและข้อมูลอื่น ๆ ในฉลากบรรจุภัณฑ์อย่างละเอียดและเคร่งครัดก่อนใช้ยาเสมอ")
                st.info("3. ปฏิบัติตามคำแนะนำ: ปฏิบัติตามคำแนะนำของแพทย์เรื่องวิธีการใช้ยา รวมถึงปริมาณและความถี่ของการใช้ยาอย่างเคร่งครัด")
                st.info("4. ไม่เกินขนาดที่แนะนำ: อย่าเกินขนาดยาที่แพทย์หรือฉลากบรรจุภัณฑ์แนะนำ และอย่าใช้ยาในระยะเวลาที่ยากำหนดสำหรับการใช้")
                st.info("5. ไม่ใช้กับยาอื่น: แนะนำให้ปรึกษาแพทย์หรือเภสัชกรก่อนใช้ยาร่วมกับยาอื่น เนื่องจากอาจมีปฏิกิริยาระหว่างยาที่อาจเสี่ยงต่อสุขภาพ")
                st.info("6. หลีกเลี่ยงผลข้างเคียง: ระวังผลข้างเคียงที่อาจเกิดขึ้น และรายงานโปรดให้แพทย์ทราบหากมีอาการผิดปกติหรืออาการข้างเคียงขึ้น")
                st.info("7. เก็บยาอย่างปลอดภัย: เก็บยาในที่สูงตัวเดียวกับเด็กและสัตว์เลี้ยง และอยู่ในบรรจุภัณฑ์ที่ป้องกันได้จากแสงแดดและความชื้น")
                st.info("8. ไม่ใช้ยาหมดอายุ: ไม่ใช้ยาหลังจากวันหมดอายุที่ระบุในฉลากบรรจุภัณฑ์")
                st.info("9. ปฏิบัติตามคำแนะนำเฉพาะ: ปฏิบัติตามคำแนะนำของแพทย์หรือเภสัชกรเฉพาะที่เหมาะสมกับสภาพอาการของ")
                st.info("10. การปฏิบัติตามคำแนะนำการใช้ยาอย่างถูกต้องจะช่วยลดความเสี่ยงต่อผลข้างเคียง")


if __name__ == "__main__":
    app = CombatMedic()
    app.main()
